In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 데이터 분석 함수로 순위 출력하기 1(RANK)
" 데이터 분석 함수: 데이터 분석을 용이하기 위해서 제공하는 함수 "  
그중 rank는 순위를 출력하는 함수  

<br>
<br>

이름, 월급, 월급에 대한 순위를 출력하시오

In [2]:
%%sql

select ename, sal, 
       rank() over (order by sal desc) as 순위
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 4),
 ('BLAKE', Decimal('2850'), 5),
 ('CLARK', Decimal('2450'), 6),
 ('ALLEN', Decimal('1600'), 7),
 ('TURNER', Decimal('1500'), 8),
 ('MILLER', Decimal('1300'), 9),
 ('WARD', Decimal('1250'), 10),
 ('MARTIN', Decimal('1250'), 10),
 ('ADAMS', Decimal('1100'), 12),
 ('JAMES', Decimal('950'), 13),
 ('SMITH', Decimal('800'), 14)]

문제 153. 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 나이가 높은 순서대로 순위를 출력하시오

In [3]:
%%sql

select replace( ename, case when length(ename)=3 then substr(ename, 2, 1)
                            when length(ename)=4 then substr(ename, -2, 1) 
                            when length(ename)=2 then substr(ename, -1, 1)  end, '*') as 이름,
       substr(age, 1, 1)||'*' as 나이,
       rank () over (order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*원', '4*', 1),
 ('권*원', '3*', 2),
 ('현*연', '3*', 3),
 ('김*순', '3*', 4),
 ('한*', '3*', 5),
 ('허*민', '3*', 6),
 ('성*창', '2*', 7),
 ('이*혁', '2*', 7),
 ('김*라', '2*', 7),
 ('송*미', '2*', 7),
 ('권*환', '2*', 11),
 ('김*원', '2*', 11),
 ('유*영', '2*', 11),
 ('김*민', '2*', 11),
 ('김*린', '2*', 15),
 ('이*성', '2*', 15),
 ('황*현', '2*', 15),
 ('남궁*미', '2*', 15),
 ('김*승', '2*', 15),
 ('신*종', '2*', 15),
 ('구*모', '2*', 21),
 ('허*', '2*', 21),
 ('정*희', '2*', 21),
 ('양*준', '2*', 21),
 ('장*진', '2*', 25),
 ('이*원', '2*', 25),
 ('김*비', '2*', 27),
 ('정*원', '2*', 27)]

문제 154. 직업, 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업별로 각각 월급이 높은 순서대로  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 출력되게 하시오!

In [4]:
%%sql

select job, ename, sal, rank () over (partition by job
                                      order by sal desc) as 순위
    from emp
    where job is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'SCOTT', Decimal('3000'), 1),
 ('ANALYST', 'FORD', Decimal('3000'), 1),
 ('CLERK', 'MILLER', Decimal('1300'), 1),
 ('CLERK', 'ADAMS', Decimal('1100'), 2),
 ('CLERK', 'JAMES', Decimal('950'), 3),
 ('CLERK', 'SMITH', Decimal('800'), 4),
 ('MANAGER', 'JONES', Decimal('2975'), 1),
 ('MANAGER', 'BLAKE', Decimal('2850'), 2),
 ('MANAGER', 'CLARK', Decimal('2450'), 3),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 1),
 ('SALESMAN', 'TURNER', Decimal('1500'), 2),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 3),
 ('SALESMAN', 'WARD', Decimal('1250'), 3)]

- partition by는 group by하고 혼동하면 안된다.
    - partition by는 데이터 분석함수에서 괄호안에 쓰는 문법으로
    - partition by job이라고 하면 직업별로 각각 파티션해서 나누겠다는 뜻
    
![image](https://user-images.githubusercontent.com/70187490/126997043-cf8301bd-5b33-4fb1-9e33-6ce3c82f8418.png)


문제 155. 부서번호, 이름, 입사일, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 부서별로 각각 먼저 입사한 사원순으로 순위가 부여되게 하시오

In [5]:
%%sql

select deptno as 부서번호, ename as 이름, to_char(hiredate,'YYYY-MM-DD') as 입사일,
       rank () over ( partition by deptno 
                      order by to_char(hiredate, 'YYYY-MM-DD') desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'MILLER', '1982-01-11', 1),
 (10, 'KING', '1981-11-17', 2),
 (10, 'CLARK', '1981-05-09', 3),
 (20, 'ADAMS', '1983-01-15', 1),
 (20, 'SCOTT', '1982-12-22', 2),
 (20, 'FORD', '1981-12-11', 3),
 (20, 'JONES', '1981-04-01', 4),
 (20, 'SMITH', '1980-12-09', 5),
 (30, 'JAMES', '1981-12-11', 1),
 (30, 'MARTIN', '1981-09-10', 2),
 (30, 'TURNER', '1981-08-21', 3),
 (30, 'BLAKE', '1981-05-01', 4),
 (30, 'WARD', '1981-02-23', 5),
 (30, 'ALLEN', '1981-02-11', 6),
 (None, 'JACK', '1982-01-10', 1)]

문제 156. 통신사, 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;통신사 별로 각각 나이가 높은 학생순으로   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위를 출력하시오

In [6]:
%%sql

select decode(lower(telecom),'sk', 'SKT', upper(telecom)) as 통신사, 
       replace(ename, case when length(ename)=2 then substr(ename, -1, 1)
                           when length(ename)=3 then substr(ename, -2, 1)
                           when length(ename)=4 then substr(ename, -2, 1) end, '*') as 이름,
       rank () over (partition by decode(lower(telecom),'sk', 'SKT', upper(telecom))
                     order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KT', '한*', 1),
 ('KT', '송*미', 2),
 ('KT', '이*혁', 2),
 ('KT', '김*라', 2),
 ('KT', '권*환', 5),
 ('KT', '김*원', 5),
 ('KT', '황*현', 7),
 ('KT', '김*린', 7),
 ('KT', '남궁*미', 7),
 ('KT', '허*', 10),
 ('KT', '정*희', 10),
 ('KT', '장*진', 12),
 ('KT', '이*원', 12),
 ('KT', '김*비', 14),
 ('LG', '김*원', 1),
 ('LG', '김*민', 2),
 ('LG', '김*승', 3),
 ('LG', '신*종', 3),
 ('SKT', '권*원', 1),
 ('SKT', '현*연', 2),
 ('SKT', '김*순', 3),
 ('SKT', '허*민', 4),
 ('SKT', '성*창', 5),
 ('SKT', '유*영', 6),
 ('SKT', '이*성', 7),
 ('SKT', '구*모', 8),
 ('SKT', '양*준', 8),
 ('SKT', '정*원', 10)]

# 데이터 분석 함수로 순위 출력하기 2(DENSE_RANK)
"조밀하게 순위를 정하겠다( 공동 1등 3명 다음 2등 )"  

<br>


문제 157. 이름, 월급, 순위를 출력하는데 dense_rank를 써서 순위가 1,2,3,4,5… 등 전부 출력되도록 하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위는 월급이 높은 순서에 대한 순위

In [7]:
%%sql

select ename as 이름, sal as 월급,
       dense_rank () over (order by sal desc) as 순위
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 3),
 ('BLAKE', Decimal('2850'), 4),
 ('CLARK', Decimal('2450'), 5),
 ('ALLEN', Decimal('1600'), 6),
 ('TURNER', Decimal('1500'), 7),
 ('MILLER', Decimal('1300'), 8),
 ('WARD', Decimal('1250'), 9),
 ('MARTIN', Decimal('1250'), 9),
 ('ADAMS', Decimal('1100'), 10),
 ('JAMES', Decimal('950'), 11),
 ('SMITH', Decimal('800'), 12)]

문제 158. 입사한 년도(4자리), 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 입사한 년도별로 각각 월급이 높은 순서대로 순위를 출력하시오!

In [8]:
%%sql

select to_char(hiredate, 'YYYY') as 입사년도, 
       ename as 이름, 
       sal as 월급,
       dense_rank () over (order by sal desc ) as 입사순번
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1981', 'KING', Decimal('5000'), 1),
 ('1982', 'SCOTT', Decimal('3000'), 2),
 ('1981', 'FORD', Decimal('3000'), 2),
 ('1981', 'JONES', Decimal('2975'), 3),
 ('1981', 'BLAKE', Decimal('2850'), 4),
 ('1981', 'CLARK', Decimal('2450'), 5),
 ('1981', 'ALLEN', Decimal('1600'), 6),
 ('1981', 'TURNER', Decimal('1500'), 7),
 ('1982', 'MILLER', Decimal('1300'), 8),
 ('1981', 'WARD', Decimal('1250'), 9),
 ('1981', 'MARTIN', Decimal('1250'), 9),
 ('1983', 'ADAMS', Decimal('1100'), 10),
 ('1981', 'JAMES', Decimal('950'), 11),
 ('1980', 'SMITH', Decimal('800'), 12)]

문제 159. 이메일 도메인, 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 이메일 도메인 별로 나이가 높은 학생순으로 출력되게 하시오!

In [14]:
%%sql

select substr(email, instr(email,'@')+1, 
                                        REGEXP_INSTR(
                                                      substr(email, instr(email,'@')+2),'[.,]+', 1)) as 도메인, 

        replace(ename, case when length(ename)=2 then substr(ename, -1, 1)
                            when length(ename)=3 then substr(ename, 2, 1)
                            when length(ename)=4 then substr(ename, -2, 1) end, '*') as 이름,
    
        substr(age, 1, 1)||'*' as 나이,
        
        dense_rank () over ( partition by substr(email, instr(email,'@')+1,
                                                 REGEXP_INSTR(substr(email, instr(email,'@')+2),'[.,]+', 1)) 
                            order by age desc) "나이 순위"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('gmail', '김*원', '4*', 1),
 ('gmail', '권*원', '3*', 2),
 ('gmail', '김*순', '3*', 3),
 ('gmail', '성*창', '2*', 4),
 ('gmail', '김*원', '2*', 5),
 ('gmail', '김*승', '2*', 6),
 ('gmail', '이*원', '2*', 7),
 ('hanmail', '허*민', '3*', 1),
 ('naver', '현*연', '3*', 1),
 ('naver', '한*', '3*', 2),
 ('naver', '이*혁', '2*', 3),
 ('naver', '김*라', '2*', 3),
 ('naver', '송*미', '2*', 3),
 ('naver', '권*환', '2*', 4),
 ('naver', '유*영', '2*', 4),
 ('naver', '김*민', '2*', 4),
 ('naver', '황*현', '2*', 5),
 ('naver', '이*성', '2*', 5),
 ('naver', '신*종', '2*', 5),
 ('naver', '김*린', '2*', 5),
 ('naver', '양*준', '2*', 6),
 ('naver', '정*희', '2*', 6),
 ('naver', '구*모', '2*', 6),
 ('naver', '허*', '2*', 6),
 ('naver', '장*진', '2*', 7),
 ('naver', '정*원', '2*', 8),
 ('naver', '김*비', '2*', 8),
 ('yahoo', '남궁*미', '2*', 1)]

![image](https://user-images.githubusercontent.com/70187490/127102029-3282a3ed-c706-4720-ab5c-0ce2be497eb4.png)

![image](https://user-images.githubusercontent.com/70187490/127105276-0b3bc42f-0fa2-46d9-b092-8217745d1688.png)

문제 160. 이름, 입사일, 순위를 출력하는데 순위가 먼저 입사한 사원순으로 순위를 부여하시오

In [16]:
%%sql

select ename as 이름, to_char(hiredate, 'YYYY-MM-DD') as 입사일, rank () over (order by hiredate) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', '1980-12-09', 1),
 ('ALLEN', '1981-02-11', 2),
 ('WARD', '1981-02-23', 3),
 ('JONES', '1981-04-01', 4),
 ('BLAKE', '1981-05-01', 5),
 ('CLARK', '1981-05-09', 6),
 ('TURNER', '1981-08-21', 7),
 ('MARTIN', '1981-09-10', 8),
 ('KING', '1981-11-17', 9),
 ('FORD', '1981-12-11', 10),
 ('JAMES', '1981-12-11', 10),
 ('JACK', '1982-01-10', 12),
 ('MILLER', '1982-01-11', 13),
 ('SCOTT', '1982-12-22', 14),
 ('ADAMS', '1983-01-15', 15)]

문제 161. 직업, 이름, 입사일, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 직업별로 각각 먼저 입사한 사원순으로 순위를 부여하시오

In [17]:
%%sql

select job as 직업, 
       ename as 이름, 
       to_char(hiredate,'YYYY-MM-DD') as 입사일, 
       rank () over (partition by job
                     order by hiredate) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD', '1981-12-11', 1),
 ('ANALYST', 'SCOTT', '1982-12-22', 2),
 ('CLERK', 'SMITH', '1980-12-09', 1),
 ('CLERK', 'JAMES', '1981-12-11', 2),
 ('CLERK', 'MILLER', '1982-01-11', 3),
 ('CLERK', 'ADAMS', '1983-01-15', 4),
 ('MANAGER', 'JONES', '1981-04-01', 1),
 ('MANAGER', 'BLAKE', '1981-05-01', 2),
 ('MANAGER', 'CLARK', '1981-05-09', 3),
 ('PRESIDENT', 'KING', '1981-11-17', 1),
 ('SALESMAN', 'ALLEN', '1981-02-11', 1),
 ('SALESMAN', 'WARD', '1981-02-23', 2),
 ('SALESMAN', 'TURNER', '1981-08-21', 3),
 ('SALESMAN', 'MARTIN', '1981-09-10', 4),
 (None, 'JACK', '1982-01-10', 1)]

문제 162. 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 월급이 높은 순서대로 순위를 부여하시오!

In [18]:
%%sql

select ename as 이름, 
       sal as 월급, 
       dense_rank () over (order by sal desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JACK', None, 1),
 ('KING', Decimal('5000'), 2),
 ('SCOTT', Decimal('3000'), 3),
 ('FORD', Decimal('3000'), 3),
 ('JONES', Decimal('2975'), 4),
 ('BLAKE', Decimal('2850'), 5),
 ('CLARK', Decimal('2450'), 6),
 ('ALLEN', Decimal('1600'), 7),
 ('TURNER', Decimal('1500'), 8),
 ('MILLER', Decimal('1300'), 9),
 ('WARD', Decimal('1250'), 10),
 ('MARTIN', Decimal('1250'), 10),
 ('ADAMS', Decimal('1100'), 11),
 ('JAMES', Decimal('950'), 12),
 ('SMITH', Decimal('800'), 13)]

문제 163. 월급이 2975는 순위가 몇위인가?

In [19]:
%%sql

select dense_rank(2975) within group (order by sal desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(4,)]

문제 164. 우리반에서 34 나이의 순위를 출력하시오

In [23]:
%%sql

select dense_rank(34) within group (order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(4,)]

문제 165. 81년 11월 17일에 입사한 사원은  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
사원 테이블에서 몇번째로 입사한 사원인가?

In [26]:
%%sql

select dense_rank(to_date('1981-11-17','YYYY-MM-DD')) 
                  within group (order by hiredate asc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(9,)]

# 데이터 분석 함수로 등급 출력하기(NTILE)
" 등급을 출력하는 함수 "  
--> 제조업에서 많이 쓰이는 함수

In [28]:
%%sql

select ename, sal, ntile(4) over (order by sal desc) as 등급
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 1),
 ('FORD', Decimal('3000'), 1),
 ('JONES', Decimal('2975'), 1),
 ('BLAKE', Decimal('2850'), 2),
 ('CLARK', Decimal('2450'), 2),
 ('ALLEN', Decimal('1600'), 2),
 ('TURNER', Decimal('1500'), 2),
 ('MILLER', Decimal('1300'), 3),
 ('WARD', Decimal('1250'), 3),
 ('MARTIN', Decimal('1250'), 3),
 ('ADAMS', Decimal('1100'), 4),
 ('JAMES', Decimal('950'), 4),
 ('SMITH', Decimal('800'), 4)]

※ 월급이 높은 순으로 정렬한 데이터를 4등급으로 나누겠다.
- 0 ~ 25% 1등급
- 25 ~ 50% 2등급
- 50 ~ 75% 3등급
- 75 ~ 100% 4등급

문제 166. 이름, 나이, 등급을 출력하는데 등급을 7등급으로 나눠서 출력하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;나이가 높은 순서대로 등급을 나누시오

In [47]:
%%sql

select replace(ename, case when length(ename) = 4 then substr(ename, -2, 1)
                           when length(ename) = 3 then substr(ename, 2, 1) 
                           else substr(ename, -1, 1) end, '*')             as 이름,
        substr(age, 1, 1)||'*'   as 나이,
        ntile(7) over (order by age desc) as "나이 등급"
        
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*원', '4*', 1),
 ('권*원', '3*', 1),
 ('현*연', '3*', 1),
 ('김*순', '3*', 1),
 ('한*', '3*', 2),
 ('허*민', '3*', 2),
 ('성*창', '2*', 2),
 ('이*혁', '2*', 2),
 ('김*라', '2*', 3),
 ('송*미', '2*', 3),
 ('권*환', '2*', 3),
 ('김*원', '2*', 3),
 ('유*영', '2*', 4),
 ('김*민', '2*', 4),
 ('김*린', '2*', 4),
 ('이*성', '2*', 4),
 ('황*현', '2*', 5),
 ('남궁*미', '2*', 5),
 ('김*승', '2*', 5),
 ('신*종', '2*', 5),
 ('구*모', '2*', 6),
 ('허*', '2*', 6),
 ('정*희', '2*', 6),
 ('양*준', '2*', 6),
 ('장*진', '2*', 7),
 ('이*원', '2*', 7),
 ('김*비', '2*', 7),
 ('정*원', '2*', 7)]

문제 167. 직업, 이름, 월급, 등급을 출력하는데 직업별 각각 등급이   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3등급으로 나눠지게 하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(등급은 월급이 높은 순서대로의 등급입니다.)

In [50]:
%%sql

 select job, ename, sal,
        ntile(3) over(partition by job order by sal) as "직업별 월급 등급"
        from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'SCOTT', Decimal('3000'), 1),
 ('ANALYST', 'FORD', Decimal('3000'), 2),
 ('CLERK', 'SMITH', Decimal('800'), 1),
 ('CLERK', 'JAMES', Decimal('950'), 1),
 ('CLERK', 'ADAMS', Decimal('1100'), 2),
 ('CLERK', 'MILLER', Decimal('1300'), 3),
 ('MANAGER', 'CLARK', Decimal('2450'), 1),
 ('MANAGER', 'BLAKE', Decimal('2850'), 2),
 ('MANAGER', 'JONES', Decimal('2975'), 3),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 1),
 ('SALESMAN', 'WARD', Decimal('1250'), 1),
 ('SALESMAN', 'TURNER', Decimal('1500'), 2),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 3),
 (None, 'JACK', None, 1)]